wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Include/gd32h77x_usart.h
/* USART last bit clock pulse */
#define CTL1_CLEN(regval)             (BIT(8) & ((uint32_t)(regval) << 8))
#define USART_CLEN_NONE               CTL1_CLEN(0)                         /*!< clock pulse of the last data bit (MSB) is not output to the CK pin */
#define USART_CLEN_EN                 CTL1_CLEN(1)                         /*!< clock pulse of the last data bit (MSB) is output to the CK pin */

/* USART clock phase */
#define CTL1_CPH(regval)              (BIT(9) & ((uint32_t)(regval) << 9))
#define USART_CPH_1CK                 CTL1_CPH(0)                          /*!< first clock transition is the first data capture edge */
#define USART_CPH_2CK                 CTL1_CPH(1)                          /*!< second clock transition is the first data capture edge */

/* USART clock polarity */
#define CTL1_CPL(regval)              (BIT(10) & ((uint32_t)(regval) << 10))
#define USART_CPL_LOW                 CTL1_CPL(0)                          /*!< steady low value on CK pin */
#define USART_CPL_HIGH                CTL1_CPL(1)                          /*!< steady high value on CK pin */

/* USART stop bits definitions */
#define CTL1_STB(regval)              (BITS(12,13) & ((uint32_t)(regval) << 12))
#define USART_STB_1BIT                CTL1_STB(0)                          /*!< 1 bit */
#define USART_STB_0_5BIT              CTL1_STB(1)                          /*!< 0.5 bit */
#define USART_STB_2BIT                CTL1_STB(2)                          /*!< 2 bits */
#define USART_STB_1_5BIT              CTL1_STB(3)                          /*!< 1.5 bits */

/* USART data is transmitted/received with the LSB/MSB first */
#define CTL1_MSBF(regval)             (BIT(19) & ((uint32_t)(regval) << 19))
#define USART_MSBF_LSB                CTL1_MSBF(0)                         /*!< LSB first */
#define USART_MSBF_MSB                CTL1_MSBF(1)                         /*!< MSB first */

/* enable USART IrDA low-power */
#define CTL2_IRLP(regval)             (BIT(2) & ((uint32_t)(regval) << 2))
#define USART_IRLP_LOW                CTL2_IRLP(1)                         /*!< low-power */
#define USART_IRLP_NORMAL             CTL2_IRLP(0)                         /*!< normal */

/* USART DMA request for receive configure */
#define CTL2_DENR(regval)             (BIT(6) & ((uint32_t)(regval) << 6))
#define USART_RECEIVE_DMA_ENABLE      CTL2_DENR(1)                         /*!< DMA request enable for reception */
#define USART_RECEIVE_DMA_DISABLE     CTL2_DENR(0)                         /*!< DMA request disable for reception */

/* USART DMA request for transmission configure */
#define CTL2_DENT(regval)             (BIT(7) & ((uint32_t)(regval) << 7))
#define USART_TRANSMIT_DMA_ENABLE     CTL2_DENT(1)                         /*!< DMA request enable for transmission */
#define USART_TRANSMIT_DMA_DISABLE    CTL2_DENT(0)                         /*!< DMA request disable for transmission */

/* configure USART RTS hardware flow control */
#define CTL2_RTSEN(regval)            (BIT(8) & ((uint32_t)(regval) << 8))
#define USART_RTS_ENABLE              CTL2_RTSEN(1)                        /*!< RTS hardware flow control enabled */
#define USART_RTS_DISABLE             CTL2_RTSEN(0)                        /*!< RTS hardware flow control disabled */

/* configure USART CTS hardware flow control */
#define CTL2_CTSEN(regval)            (BIT(9) & ((uint32_t)(regval) << 9))
#define USART_CTS_ENABLE              CTL2_CTSEN(1)                        /*!< CTS hardware flow control enabled */
#define USART_CTS_DISABLE             CTL2_CTSEN(0)                        /*!< CTS hardware flow control disabled */

/* configure USART one sample bit method */
#define CTL2_OSB(regval)              (BIT(11) & ((uint32_t)(regval) << 11))
#define USART_OSB_1BIT                CTL2_OSB(1)                          /*!< 1 sample bit */
#define USART_OSB_3BIT                CTL2_OSB(0)                          /*!< 3 sample bits */

/* USART driver enable polarity mode */
#define CTL2_DEP(regval)              (BIT(15) & ((uint32_t)(regval) << 15))
#define USART_DEP_HIGH                CTL2_DEP(0)                          /*!< DE signal is active high */
#define USART_DEP_LOW                 CTL2_DEP(1)                          /*!< DE signal is active low */

/* USART wakeup mode from deep-sleep mode */
#define CTL2_WUM(regval)              (BITS(20,21) & ((uint32_t)(regval) << 20))
#define USART_WUM_ADDR                CTL2_WUM(0)                          /*!< WUF active on address match */
#define USART_WUM_STARTB              CTL2_WUM(2)                          /*!< WUF active on start bit */
#define USART_WUM_RBNE                CTL2_WUM(3)                          /*!< WUF active on RBNE */

/* USART address 0 detection mode */
#define CTL1_ADDM0(regval)            (BIT(4) & ((uint32_t)(regval) << 4))
#define USART_ADDM0_4BIT              CTL1_ADDM0(0)                        /*!< 4-bit address detection */
#define USART_ADDM0_FULLBIT           CTL1_ADDM0(1)                        /*!< full-bit address detection */

/* USART address 1 detection mode */
#define CTL2_ADDM1(regval)            (BIT(23) & ((uint32_t)(regval) << 23))
#define USART_ADDM1_4BIT              CTL2_ADDM1(0)                        /*!< 4-bit address detection */
#define USART_ADDM1_FULLBIT           CTL2_ADDM1(1)                        /*!< full-bit address detection */

/* USART hardware flow control coherence mode */
#define CHC_HCM(regval)               (BIT(0) & ((uint32_t)(regval) << 0))
#define USART_HCM_NONE                CHC_HCM(0)                           /*!< nRTS signal equals to the rxne status register */
#define USART_HCM_EN                  CHC_HCM(1)                           /*!< nRTS signal is set when the last data bit has been sampled */

/* configure USART transmit FIFO threshold */
#define FCS_TFTCFG(regval)            (BITS(19,21) & ((uint32_t)(regval) << 19))
#define USART_TFTCFG_THRESHOLD_1_8    FCS_TFTCFG(0)                       /*!< transmit FIFO reaches 1/8 of its depth */
#define USART_TFTCFG_THRESHOLD_1_4    FCS_TFTCFG(1)                       /*!< transmit FIFO reaches 1/4 of its depth */
#define USART_TFTCFG_THRESHOLD_1_2    FCS_TFTCFG(2)                       /*!< transmit FIFO reaches 1/2 of its depth */
#define USART_TFTCFG_THRESHOLD_3_4    FCS_TFTCFG(3)                       /*!< transmit FIFO reaches 3/4 of its depth */
#define USART_TFTCFG_THRESHOLD_7_8    FCS_TFTCFG(4)                       /*!< transmit FIFO reaches 7/8 of its depth */
#define USART_TFTCFG_THRESHOLD_EMPTY  FCS_TFTCFG(5)                       /*!< transmit FIFO becomes empty */

/* configure USART receive FIFO threshold */
#define FCS_RFTCFG(regval)            (BITS(16,18) & ((uint32_t)(regval) << 16))
#define USART_RFTCFG_THRESHOLD_1_8    FCS_RFTCFG(0)                       /*!< receive FIFO reaches 1/8 of its depth */
#define USART_RFTCFG_THRESHOLD_1_4    FCS_RFTCFG(1)                       /*!< receive FIFO reaches 1/4 of its depth */
#define USART_RFTCFG_THRESHOLD_1_2    FCS_RFTCFG(2)                       /*!< receive FIFO reaches 1/2 of its depth */
#define USART_RFTCFG_THRESHOLD_3_4    FCS_RFTCFG(3)                       /*!< receive FIFO reaches 3/4 of its depth */
#define USART_RFTCFG_THRESHOLD_7_8    FCS_RFTCFG(4)                       /*!< receive FIFO reaches 7/8 of its depth */
#define USART_RFTCFG_THRESHOLD_FULL   FCS_RFTCFG(5)                       /*!< receive FIFO becomes full */

